#+TITLE: Remastering a LiveCD
#+AUTHOR: Hippie Hacker
#+AUTHOR: Stephen Heywood
#+AUTHOR: Zach Mandeville
#+EMAIL: hh@ii.coop
#+EMAIL: stephen@ii.coop
#+EMAIL: zz@ii.coop
#+CREATOR: ii.coop
#+DATE: 15th of January, 2019
#+PROPERTY: header-args:shell :results output code verbatim replace
#+PROPERTY: header-args:shell+ :dir (file-name-directory buffer-file-name)
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (user-login-name)
#+STARTUP: showeverything

** Extract / verify the Squashfs

#+NAME extract squashfs
#+BEGIN_SRC tmate
  sudo unsquashfs -d edit cd/casper/filesystem.squashfs
#+END_SRC

#+NAME inspect editable extraction
#+BEGIN_SRC shell
  sudo ls -la edit/bin/bash
#+END_SRC

#+RESULTS:
: -rwxr-xr-x 1 root root 1113504 Apr  5  2018 edit/bin/bash

* Verify base Docker Image 

#+NAME: check docker image
#+BEGIN_SRC shell
docker images | grep ubuntu-18.04.1-desktop-amd64.iso
#+END_SRC

#+RESULTS: check docker image
: ubuntu-18.04.1-desktop-amd64.iso   latest              6ff56c22bba8        5 minutes ago       4.31GB

#+NAME: verify container works
#+BEGIN_SRC shell
docker run -i ubuntu-18.04.1-desktop-amd64.iso lsb_release -a
#+END_SRC

#+RESULTS: verify container works
: Distributor ID:	Ubuntu
: Description:	Ubuntu 18.04.1 LTS
: Release:	18.04
: Codename:	bionic

